# Data Reading & Writting in Pandas

In [1]:
import pandas as pd  
import numpy as np

In [2]:
df=pd.read_table("DataSets/data.txt")
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [3]:
df2=pd.read_table("Datasets/data2.txt")
df2

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [4]:
df2=pd.read_table("Datasets/data2.txt", sep=",")
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [5]:
df=pd.read_table("Datasets/data2.txt", sep=",")
df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [6]:
df=pd.read_table("Datasets/data2.txt",
                 sep=",",
                 header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

In [7]:
df=pd.read_table("Datasets/data2.txt",
                 sep=",",
                 header=None, 
                 names=["name","score","sex"])
df

   name  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

In [ ]:
# read_csv
# read_excel

In [ ]:
# Write
# to_csv
# to_excel

In [9]:
x = df.describe()

In [10]:
x.head()

           score
count   5.000000
mean   80.000000
std     7.905694
min    70.000000
25%    75.000000

## Writing Data

In [11]:
x.to_csv("new_data.csv")

In [12]:
x.to_excel("new_data.xlsx")